Catalogs/ПакетыДокументовДля1САрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПакетыДокументовДля1САрхива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицоБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодразделениеБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицоБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбменаСАрхивом</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СотрудникБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыБИА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СтатусыОбменаДокументовБИА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОбменаДокументовБИА</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументБИА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыБИА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПакетДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыДокументовДля1САрхива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОбменаС1САрхивом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаВАрхивВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГотовКВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриЗагрузкеВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриПроверкеВАрхиве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятВАрхив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СобытияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СобытияОбменаС1САрхивом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПакетыДокументовДля1САрхива/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПакетыТабЧасть.Документ КАК ДокументВЭтомПакете,
		|	ПакетыТабЧасть.Документ КАК ДокументВДругомПакете,
		|	ПакетыТабЧасть.Ссылка КАК Пакет
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыТабЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива КАК Пакеты
		|		ПО ПакетыТабЧасть.Ссылка = Пакеты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыБИА
		|		ПО ПакетыТабЧасть.Документ = ДокументыБИА.Ссылка
		|ГДЕ
		|	ПакетыТабЧасть.Документ В(&ДокументыПакета)
		|	И ПакетыТабЧасть.Ссылка <> &Ссылка
		|	И НЕ Пакеты.ПометкаУдаления
		|	И НЕ ДокументыБИА.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументыЭтогоПакета.Ссылка,
		|	ДокументыДругогоПакета.Ссылка,
		|	ПакетыТабЧасть.Ссылка
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыЭтогоПакета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыДругогоПакета
		|		ПО ДокументыЭтогоПакета.ОбъектОснование = ДокументыДругогоПакета.ОбъектОснование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыТабЧасть
		|		ПО ДокументыДругогоПакета.Ссылка = ПакетыТабЧасть.Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива КАК Пакеты
		|		ПО ПакетыТабЧасть.Ссылка = Пакеты.Ссылка
		|ГДЕ
		|	ДокументыЭтогоПакета.Ссылка В(&ДокументыПакета)
		|	И НЕ ДокументыДругогоПакета.Ссылка В (&ДокументыПакета)
		|	И ПакетыТабЧасть.Ссылка <> &Ссылка
		|	И НЕ Пакеты.ПометкаУдаления
		|	И НЕ ДокументыЭтогоПакета.ПометкаУдаления
		|	И НЕ ДокументыДругогоПакета.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументыПакета", Документы.ВыгрузитьКолонку("Документ"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Отказ = Истина
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДокументВЭтомПакете = Выборка.ДокументВДругомПакете Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Документ %1 уже добавлен в %2'"),
				Выборка.ДокументВЭтомПакете, Выборка.Пакет));
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Документ %1 не может быть помещен в этот пакет, т.к. документ %2,
						|созданный на основании того же объекта, добавлен в %3'"),
				Выборка.ДокументВЭтомПакете, Выборка.ДокументВДругомПакете, Выборка.Пакет));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДатаСоздания = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитовДоИзменения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Ссылка, "СтатусОбменаСАрхивом, ПометкаУдаления");
	ДополнительныеСвойства.Вставить("ЗначенияРеквизитовДоИзменения", ЗначенияРеквизитовДоИзменения);
	
	Если (Не ДополнительныеСвойства.Свойство("ПропуститьПроверкуСтатусаПриЗаписи")
				Или ДополнительныеСвойства.ПропуститьПроверкуСтатусаПриЗаписи <> Истина)
			И ЗначениеЗаполнено(ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом)
			И Не ОбменСАрхивом.ДоступноРедактированиеПоСтатусу(
				ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом, Истина) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Запрещено изменение пакета в статусе ""%1""'"),
			ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
			ДатаСоздания = ТекущаяДатаСеанса();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Создал) Тогда
			Создал = ОбменСАрхивом.ФизЛицоТекущегоПользователя();
		КонецЕсли;
	КонецЕсли;
	
	Если СтатусОбменаСАрхивом = Перечисления.СтатусыОбменаС1САрхивом.ГотовКВыгрузке Тогда
		ДатаПередачи = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитовДоИзменения = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("ЗначенияРеквизитовДоИзменения", ЗначенияРеквизитовДоИзменения) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭтоНовый = ЗначенияРеквизитовДоИзменения.ПометкаУдаления = Неопределено;
	ИзмененаПометка = Не ЭтоНовый И ПометкаУдаления <> ЗначенияРеквизитовДоИзменения.ПометкаУдаления;
	ИзмененСтатус = Не ЭтоНовый И ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом <> СтатусОбменаСАрхивом;
	Если Не ПометкаУдаления И (ЭтоНовый Или ИзмененСтатус Или ИзмененаПометка) Тогда
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		Событие = ОбменСАрхивом.СобытиеДляЛога();
		Событие.ОсновнойОбъект = Ссылка;
		Событие.ТипСобытия = Перечисления.СобытияОбменаС1САрхивом.Информация;
		Если ЭтоНовый Тогда
			Событие.КраткоеОписание = НСтр("ru = 'Пакет создан'");
		ИначеЕсли ИзмененаПометка Тогда
			Событие.КраткоеОписание = НСтр("ru = 'Снята пометка удаления'");
		ИначеЕсли ИзмененСтатус Тогда
			Событие.КраткоеОписание = СтрШаблон(НСтр("ru = 'Статус обмена изменен с ""%1"" на ""%2""'"),
				ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом, СтатусОбменаСАрхивом);
		КонецЕсли;
		ОбменСАрхивом.ЗаписатьВЛог(Событие);
		СтатусыДокументовНабор = РегистрыСведений.СтатусыОбменаДокументовБИА.СоздатьНаборЗаписей();
		СтатусыДокументовНабор.Отбор.ПакетДокументов.Установить(Ссылка);
		Для Каждого Стр Из Документы Цикл
			СтатусЗапись = СтатусыДокументовНабор.Добавить();
			СтатусЗапись.ДокументБИА = Стр.Документ;
			СтатусЗапись.ПакетДокументов = Ссылка;
			СтатусЗапись.Статус = СтатусОбменаСАрхивом;
			СтатусЗапись.Дата = ТекущаяДатаСеанса;
		КонецЦикла;
		СтатусыДокументовНабор.Записать();
		Если СтатусОбменаСАрхивом = Перечисления.СтатусыОбменаС1САрхивом.ПринятВАрхив Тогда
			ОбъектыДляОбработки = ОбъектыОснованияПринятыеВАрхив();
			ОбменСАрхивом.УдалитьДанныеДокументовПринятыхВАрхив(ОбъектыДляОбработки);
		КонецЕсли;
	ИначеЕсли ПометкаУдаления И ИзмененаПометка Тогда
		Событие = ОбменСАрхивом.СобытиеДляЛога();
		Событие.ОсновнойОбъект = Ссылка;
		Событие.ТипСобытия = Перечисления.СобытияОбменаС1САрхивом.Информация;
		Событие.КраткоеОписание = НСтр("ru = 'Пакет помечен на удаление'");
		ОбменСАрхивом.ЗаписатьВЛог(Событие);
		СтатусыДокументовНабор = РегистрыСведений.СтатусыОбменаДокументовБИА.СоздатьНаборЗаписей();
		СтатусыДокументовНабор.Отбор.ПакетДокументов.Установить(Ссылка);
		СтатусыДокументовНабор.Записать();
		ОбменСАрхивом.ОтменитьУдалениеДанныхДокументовПринятыхВАрхив(ОбъектыДляОбработки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектыОснованияПринятыеВАрхив() 
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыБИА.ОбъектОснование КАК ОбъектОснование
		|ПОМЕСТИТЬ ОбъектыВПакетах
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыДокументовДля1САрхиваДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыБИА
		|		ПО ПакетыДокументовДля1САрхиваДокументы.Документ = ДокументыБИА.Ссылка
		|ГДЕ
		|	ДокументыБИА.ПометкаУдаления = ЛОЖЬ
		|	И ПакетыДокументовДля1САрхиваДокументы.Документ.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИА.Ссылка) КАК Количество,
		|	ДокументыБИА.ОбъектОснование КАК ОбъектОснование
		|ПОМЕСТИТЬ КоличествоВсехДокументовБИА
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыВПакетах КАК ОбъектыВПакетах
		|		ПО ДокументыБИА.ОбъектОснование = ОбъектыВПакетах.ОбъектОснование
		|			И (ДокументыБИА.ПометкаУдаления = ЛОЖЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыБИА.ОбъектОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИАВСтатусе.Ссылка) КАК Количество,
		|	ДокументыБИАВСтатусе.ОбъектОснование КАК ОбъектОснование
		|ПОМЕСТИТЬ КоличествоДокументовБИАВСтатусе
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИАВСтатусе
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыВПакетах КАК ОбъектыВПакетах
		|		ПО ДокументыБИАВСтатусе.ОбъектОснование = ОбъектыВПакетах.ОбъектОснование
		|			И (ДокументыБИАВСтатусе.ПометкаУдаления = ЛОЖЬ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбменаДокументовБИА КАК СтатусыОбменаДокументовБИА
		|		ПО (СтатусыОбменаДокументовБИА.ДокументБИА = ДокументыБИАВСтатусе.Ссылка)
		|			И (СтатусыОбменаДокументовБИА.Статус = &Статус)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыБИАВСтатусе.ОбъектОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоличествоВсехДокументовБИА.ОбъектОснование КАК ОбъектОснование
		|ИЗ
		|	КоличествоВсехДокументовБИА КАК КоличествоВсехДокументовБИА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоДокументовБИАВСтатусе КАК КоличествоДокументовБИАВСтатусе
		|		ПО (КоличествоДокументовБИАВСтатусе.ОбъектОснование = КоличествоВсехДокументовБИА.ОбъектОснование)
		|			И (КоличествоДокументовБИАВСтатусе.Количество = КоличествоВсехДокументовБИА.Количество)";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыОбменаС1САрхивом.ПринятВАрхив);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции	

#КонецОбласти

#КонецЕсли
